# GenericDiffuseImageFade Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Generic..::..GenericDiffuseImageFade Property
Generic Class See Also
---
The property labeled "Image Fade" from the "Generic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GenericDiffuseImageFade { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericDiffuseImageFade As String
	Get
```

Visual C++
---
```text
public:
static property String^ GenericDiffuseImageFade {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
# See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace